OpenFOAM-dev/tutorials/multicomponentFluid/simplifiedSiwek/constant/coalCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    location    "";
    class       vectorField;
    object      coalCloudPositions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(0.005 0.5 0.05)
(0.010 0.5 0.05)
(0.015 0.5 0.05)
(0.020 0.5 0.05)
(0.025 0.5 0.05)
(0.030 0.5 0.05)
(0.035 0.5 0.05)
(0.040 0.5 0.05)
(0.045 0.5 0.05)
(0.005 0.6 0.05)
(0.010 0.6 0.05)
(0.015 0.6 0.05)
(0.020 0.6 0.05)
(0.025 0.6 0.05)
(0.030 0.6 0.05)
(0.035 0.6 0.05)
(0.040 0.6 0.05)
(0.045 0.6 0.05)
(0.005 0.7 0.05)
(0.010 0.7 0.05)
(0.015 0.7 0.05)
(0.020 0.7 0.05)
(0.025 0.7 0.05)
(0.030 0.7 0.05)
(0.035 0.7 0.05)
(0.040 0.7 0.05)
(0.045 0.7 0.05)
)
// ************************************************************************* //
